{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_deepseek.DeepseekV3Config",
    "AutoModel": "modeling_deepseek.DeepseekV3Model",
    "AutoModelForCausalLM": "modeling_deepseek.DeepseekV3ForCausalLM"
  },
  "aux_loss_alpha": 0.001,
  "bos_token_id": 163584,
  "eos_token_id": 163585,
  "first_k_dense_replace": 1,
  "hidden_act": "silu",
  "hidden_size": 7168,
  "initializer_range": 0.02,
  "intermediate_size": 18432,
  "kv_lora_rank": 512,
  "max_position_embeddings": 131072,
  "model_type": "deepseek_v3",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "n_group": 1,
  "n_routed_experts": 16,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 24,
  "num_key_value_heads": 64,
  "num_nextn_predict_layers": 0,
  "pretraining_tp": 1,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ]
  },
  "rms_norm_eps": 1e-06,
  "rope_theta": 50000.0,
  "routed_scaling_factor": 2.827,
  "rope_scaling": {
    "beta_fast": 1.0,
    "beta_slow": 1.0,
    "factor": 32.0,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 4096,
    "type": "yarn"
  },
  "scoring_func": "sigmoid",
  "seq_aux": true,
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.48.3",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 163840,
  "k2_mini_info": {
    "original_model": "/root/kimi-k2-instruct",
    "original_layers": 61,
    "original_experts": 384,
    "selected_layers": [
      0,
      10,
      11,
      12,
      14,
      15,
      17,
      18,
      19,
      20,
      21,
      24,
      28,
      29,
      31,
      32,
      36,
      37,
      38,
      39,
      41,
      46,
      49,
      60
    ],
    "layer_expert_mapping": {
      "0": [],
      "10": [
        4,
        32,
        63,
        90,
        110,
        127,
        158,
        189,
        222,
        237,
        253,
        285,
        303,
        320,
        351,
        381
      ],
      "11": [
        2,
        21,
        42,
        62,
        83,
        123,
        164,
        184,
        206,
        227,
        252,
        274,
        295,
        330,
        357,
        383
      ],
      "12": [
        1,
        18,
        37,
        69,
        102,
        137,
        155,
        173,
        192,
        211,
        244,
        274,
        300,
        327,
        352,
        377
      ],
      "14": [
        1,
        39,
        74,
        93,
        112,
        146,
        176,
        194,
        217,
        235,
        253,
        288,
        309,
        334,
        358,
        382
      ],
      "15": [
        1,
        21,
        39,
        57,
        78,
        116,
        135,
        155,
        184,
        214,
        240,
        268,
        301,
        325,
        355,
        382
      ],
      "17": [
        0,
        18,
        36,
        73,
        104,
        127,
        149,
        168,
        186,
        211,
        226,
        259,
        282,
        305,
        344,
        380
      ],
      "18": [
        0,
        32,
        51,
        95,
        119,
        140,
        166,
        191,
        213,
        236,
        257,
        286,
        308,
        333,
        357,
        381
      ],
      "19": [
        4,
        38,
        62,
        80,
        98,
        117,
        140,
        159,
        197,
        240,
        260,
        280,
        299,
        317,
        351,
        381
      ],
      "20": [
        2,
        20,
        41,
        60,
        82,
        101,
        123,
        158,
        179,
        201,
        234,
        270,
        289,
        312,
        347,
        382
      ],
      "21": [
        0,
        30,
        64,
        100,
        130,
        161,
        180,
        194,
        218,
        235,
        254,
        283,
        301,
        318,
        348,
        381
      ],
      "24": [
        4,
        26,
        53,
        76,
        103,
        133,
        158,
        176,
        200,
        225,
        250,
        270,
        291,
        326,
        348,
        377
      ],
      "28": [
        0,
        26,
        46,
        67,
        91,
        120,
        144,
        172,
        189,
        212,
        239,
        264,
        289,
        332,
        352,
        379
      ],
      "29": [
        1,
        29,
        57,
        78,
        102,
        129,
        153,
        180,
        207,
        252,
        277,
        299,
        320,
        342,
        364,
        383
      ],
      "31": [
        1,
        19,
        37,
        63,
        80,
        117,
        157,
        175,
        194,
        232,
        250,
        272,
        292,
        311,
        348,
        383
      ],
      "32": [
        0,
        30,
        48,
        67,
        93,
        112,
        132,
        171,
        202,
        234,
        268,
        296,
        310,
        326,
        357,
        383
      ],
      "36": [
        0,
        29,
        56,
        87,
        116,
        134,
        152,
        182,
        198,
        214,
        246,
        278,
        295,
        314,
        350,
        383
      ],
      "37": [
        1,
        33,
        64,
        79,
        94,
        127,
        156,
        188,
        205,
        221,
        253,
        283,
        300,
        318,
        350,
        383
      ],
      "38": [
        1,
        32,
        62,
        79,
        99,
        120,
        141,
        162,
        183,
        223,
        263,
        283,
        303,
        326,
        344,
        383
      ],
      "39": [
        3,
        43,
        64,
        83,
        125,
        144,
        167,
        188,
        209,
        232,
        252,
        276,
        297,
        335,
        357,
        381
      ],
      "41": [
        0,
        17,
        35,
        54,
        72,
        107,
        123,
        143,
        175,
        205,
        233,
        262,
        292,
        322,
        351,
        382
      ],
      "46": [
        1,
        17,
        36,
        68,
        100,
        117,
        136,
        167,
        198,
        228,
        259,
        278,
        294,
        322,
        350,
        382
      ],
      "49": [
        2,
        29,
        52,
        73,
        100,
        124,
        147,
        172,
        196,
        221,
        244,
        267,
        287,
        310,
        333,
        379
      ],
      "60": [
        2,
        30,
        56,
        81,
        96,
        112,
        131,
        150,
        176,
        207,
        227,
        239,
        273,
        307,
        340,
        382
      ]
    },
    "compression_ratio": 61.0
  }
}