{
  "metadata": {
    "total_size": 23860128480
  },
  "weight_map": {
    "model.embed_tokens.weight": "model-1-of-5.safetensors",
    "model.layers.0.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.0.mlp.down_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.mlp.down_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.mlp.gate_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.mlp.gate_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.mlp.up_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.mlp.up_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.1.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.1.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.1.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.1.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.10.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.10.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.10.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.10.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.11.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.11.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.11.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.11.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.12.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.12.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.12.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.12.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.12.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.13.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.13.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.13.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.13.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.13.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.14.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.14.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.14.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.14.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.14.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.15.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.15.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.15.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.15.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.15.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.16.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.16.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.16.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.16.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.16.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.17.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.17.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.17.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.17.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.17.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.18.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.18.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.18.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.18.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.18.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.19.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.19.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.19.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.19.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.19.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.2.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.2.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.2.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.2.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.20.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.20.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.20.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.20.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.20.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.21.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.21.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.21.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.21.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.21.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.22.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.22.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.22.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.22.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.22.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.3.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.3.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.3.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.3.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.3.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.4.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.4.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.4.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.4.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.4.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.5.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.5.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.5.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.5.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.5.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.6.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.6.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.6.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.6.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.6.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.7.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.7.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.7.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.7.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.7.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.8.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.8.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.8.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.8.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.8.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "model.layers.9.input_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.9.mlp.gate.e_score_correction_bias": "model-1-of-5.safetensors",
    "model.layers.9.mlp.gate.weight": "model-1-of-5.safetensors",
    "model.layers.9.post_attention_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.kv_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.kv_a_proj_with_mqa.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.kv_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.kv_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.o_proj.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.o_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.q_a_layernorm.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.q_a_proj.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.q_a_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.q_b_proj.weight": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.q_b_proj.weight_scale_inv": "model-1-of-5.safetensors",
    "model.layers.9.self_attn.rotary_emb.inv_freq": "model-1-of-5.safetensors",
    "lm_head.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.0.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.1.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.10.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.11.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.12.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.13.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.14.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.15.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.2.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.3.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.4.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.5.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.6.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.7.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.8.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.1.mlp.experts.9.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.0.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.1.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.10.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.11.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.12.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.13.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.14.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.15.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.2.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.3.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.4.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.5.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.6.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.7.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.8.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.down_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.down_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.gate_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.gate_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.up_proj.weight": "model-2-of-5.safetensors",
    "model.layers.2.mlp.experts.9.up_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.23.input_layernorm.weight": "model-2-of-5.safetensors",
    "model.layers.23.mlp.gate.e_score_correction_bias": "model-2-of-5.safetensors",
    "model.layers.23.mlp.gate.weight": "model-2-of-5.safetensors",
    "model.layers.23.post_attention_layernorm.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.kv_a_layernorm.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.kv_a_proj_with_mqa.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.kv_b_proj.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.kv_b_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.o_proj.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.o_proj.weight_scale_inv": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.q_a_layernorm.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.q_a_proj.weight": "model-2-of-5.safetensors",
    "model.layers.23.self_attn.q_a_proj.weight_scale_inv": "model-2-of-5.safetensors",
