{
  "architectures": ["KimiK2ForCausalLM"],
  "model_type": "kimi_k2_mini",
  "hidden_size": 7168,
  "intermediate_size": 18432,
  "moe_intermediate_size": 2048,
  "num_hidden_layers": 24,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "n_routed_experts": 16,
  "n_shared_experts": 1,
  "num_experts_per_tok": 4,
  "moe_layer_freq": 1,
  "hidden_act": "silu",
  "max_position_embeddings": 128000,
  "initializer_range": 0.006,
  "rms_norm_eps": 1e-6,
  "use_cache": true,
  "tie_word_embeddings": false,
  "rope_theta": 10000000,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "vocab_size": 163840,
  "first_k_dense_replace": 1,
  "seq_aux": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.0",
  "original_model": "kimi-k2-instruct",
  "compression_info": {
    "original_layers": 61,
    "original_experts": 384,
    "compression_ratio": 32.9,
    "selected_layers": "evenly_spaced",
    "expert_selection": "top_k_by_activation"
  }
}
