{
  "metadata": {
    "total_size": 3343934784
  },
  "weight_map": {
    "model.embed_tokens.weight": "model.safetensors",
    "model.layers.0.input_layernorm.weight": "model.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model.safetensors",
    "model.layers.0.self_attn.kv_a_layernorm.weight": "model.safetensors",
    "model.layers.0.self_attn.q_a_layernorm.weight": "model.safetensors",
    "model.layers.0.mlp.down_proj.weight": "model.safetensors",
    "model.layers.0.mlp.down_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.mlp.gate_proj.weight": "model.safetensors",
    "model.layers.0.mlp.gate_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.mlp.up_proj.weight": "model.safetensors",
    "model.layers.0.mlp.up_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.kv_a_proj_with_mqa.weight": "model.safetensors",
    "model.layers.0.self_attn.kv_a_proj_with_mqa.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.kv_b_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.kv_b_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.o_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.q_a_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.q_a_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.q_b_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.q_b_proj.weight_scale_inv": "model.safetensors",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "model.safetensors"
  }
}